УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/Осмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Осмотр</name>
  <basedOn>Document.ЗаписьНаПрием</basedOn>
  <registerRecords>InformationRegister.МедицинскиеКарты</registerRecords>
  <attributes>
    <name>ЗаписьНаПрием</name>
    <type>
      <types>DocumentRef.ЗаписьНаПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Хозяин</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОсмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееСостояние</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диагноз</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОсмотра</name>
    <type>
      <types>EnumRef.СтатусыОсмотра</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>EnumRef.СпособПрименения</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ПечатьОсмотра(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьОсмотра)
	Макет = Документы.Осмотр.ПолучитьМакет("ПечатьОсмотра");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Осмотр.Питомец,
		|	Осмотр.Врач,
		|	Осмотр.ДатаОсмотра,
		|	Осмотр.Жалобы,
		|	Осмотр.ОбщееСостояние,
		|	Осмотр.Температура,
		|	Осмотр.Вес,
		|	Осмотр.Диагноз,
		|	Осмотр.Рекомендации,
		|	Осмотр.Назначения.(
		|		Товар,
		|		Дозировка,
		|		СпособПрименения,
		|		Периодичность,
		|		Продолжительность,
		|		Примечание)
		|ИЗ
		|	Документ.Осмотр КАК Осмотр
		|ГДЕ
		|	Осмотр.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНазначенияШапка = Макет.ПолучитьОбласть("НазначенияШапка");
	ОбластьНазначения = Макет.ПолучитьОбласть("Назначения");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьНазначенияШапка);
		ВыборкаНазначения = Выборка.Назначения.Выбрать();
		Пока ВыборкаНазначения.Следующий() Цикл
			ОбластьНазначения.Параметры.Заполнить(ВыборкаНазначения);
			ТабДок.Вывести(ОбластьНазначения, ВыборкаНазначения.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
